tc3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (4.1 0 0)    //0
    (0 4.1 0)  //1
    (-4.1 0 0) //2
    (0 -4.1 0) //3
    (5.5 0 0) //4
    (0 5.5 0) //5
    (-5.5 0 0) //6
    (0 -5.5 0) //7
    
    (4.1 0 10)    //8
    (0 4.1 10)  //9
    (-4.1 0 10) //10
    (0 -4.1 10) //11
    (5.5 0 10) //12
    (0 5.5 10) //13
    (-5.5 0 10) //14
    (0 -5.5 10) //15
);

blocks
(
   hex (0 4 5 1 8 12 13 9) (28 28 200) simpleGrading (1 1 1)
   hex (1 5 6 2 9 13 14 10) (28 28 200) simpleGrading (1 1 1)
   hex (3 2 6 7 11 10 14 15) (28 28 200) simpleGrading (1 1 1)
   hex (3 7 4 0 11 15 12 8) (28 28 200) simpleGrading (1 1 1)
);

edges
(

	arc 0 1 (2.899 2.899 0)
	arc 4 5 (3.889 3.889 0)
	arc 1 2 (-2.899 2.899 0)
	arc 5 6 (-3.889 3.889 0)
	arc 2 3 (-2.899 -2.899 0)
	arc 6 7 (-3.889 -3.889 0)
	arc 3 0 (2.899 -2.899 0)
	arc 7 4 (3.889 -3.889 0)

	arc 8 9 (2.899 2.899 10)
	arc 12 13 (3.889 3.889 10)
	arc 9 10 (-2.899 2.899 10)
	arc 13 14 (-3.889 3.889 10)
	arc 10 11 (-2.899 -2.899 10)
	arc 14 15 (-3.889 -3.889 10)
	arc 11 8 (2.899 -2.899 10)
	arc 15 12 (3.889 -3.889 10)

);

boundary
(
    top
    {
        type patch;
        faces
        (
		(8 12 13 9)
		(14 13 9 10)
		(14 10 11 15)
		(15 11 8 12)
        );
    }
    bottom
    {
        type wall;
        faces
        (
		(0 1 5 4)
		(2 6 5 1)
		(7 6 2 3)
		(3 0 4 7)
        );
    }
    rotatingWall
    {
        type patch;
        faces
        (
		(0 8 1 9)
		(2 1 9 10)
		(2 10 3 11)
		(3 11 0 8)
        );
    }
    wall
    {
	type wall;
	faces
	(
		(5 13 4 12)
		(6 14 5 13)
		(7 15 14 6)
		(15 12 4 7)
	);
    }
    frontAndBack
    {
	type empty;
	faces
	(


	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
